common/models/LoginForm.php

SELECT * FROM `le_member` WHERE `uid`='1'
UPDATE `le_member` SET `login`='185', `last_login_ip`='0', `last_login_time`='1453370995' WHERE `uid`='1'
---
    public function reglogin($uid)
    {
        //检测用户是否在当前应用登录
        $userinfo=User::find()->where('id='.$uid)->asArray()->one();
        $member=LeMember::findOne($userinfo['id']);
        if(!empty($member))
        {
            $login_time=$member->login;
            $member->last_login_ip=CommonHelper::get_client_ip(1);
            $member->last_login_time=CommonHelper::CurrentTime();
            $member->login=$login_time+1;
            if(!$member->save())