menu/models/LeMenuDB.php

SELECT * FROM `le_menu` WHERE url like '%article/mydocument%'
---
    function getMenus($CurrentPath='')
    {
        if(empty($menus)){
            // 获取主菜单
            $where['pid']   =   0;
            $where['hide']  =   0;
            $where['status']=0;
             if(!CommonHelper::C('DEVELOP_MODE')){ // 是否开发者模式
                 $where['is_dev']    =   0;
             }
            $menus['main']  = LeMenu::find()->where($where)->orderBy('sort asc')->asArray()->all();
            //若果是类容菜单，则调另一个方法
            $menus['child'] = array(); //设置子节点
            //高亮主菜单
            $current=LeMenu::find()->where("url like '%".$CurrentPath."%'")->asArray()->one();

SELECT DISTINCT * FROM `le_menu` WHERE pid = 2
---
                    if($item['title'] == $nav_first_title){
                        $menus['main'][$key]['class']='current';
                        //生成child树
                        $groups=LeMenu::find()->where("pid = ".$item['id']."") ->distinct(true)->asArray()->all();

SELECT * FROM `le_category` WHERE `status`=1 ORDER BY `pid`, `sort`
---
    public function getMenu($getcate_id=0)
    {
        //获取动态分类
//        $cate_auth  =   AuthGroupModel::getAuthCategories(UID);	//获取当前用户所有的内容权限节点
//        $cate_auth  =   $cate_auth == null ? array() : $cate_auth;
//        $cate       =   M('Category')->where(array('status'=>1))->field('id,title,pid,allow_publish')->order('pid,sort')->select();
        $cate=LeCategory::find()->where(array('status'=>1))->orderBy('pid,sort')->asArray()->all();

SELECT * FROM `le_menu` WHERE id=2
---
    public function getPath($id){
        $path = array();
        $nav=LeMenu::find()->where('id='.$id.'')->asArray()->one();