member/models/LeEmailDB.php

    function getList()
    {
        return LeEmail::find()->where(array('marks'=>0))->asArray()->all();
---
SELECT * FROM `le_email` WHERE `marks`=0