document/models/LeDocumentDB.php

SELECT COUNT(*) FROM `le_document` WHERE `pid`='73'
---
    function get_subdocument_count($id=0)
    {
        $count=LeDocument::find()->where(array('pid'=>$id))->count();