system/models/LeActionDB.php

SELECT * FROM `le_action` WHERE `name`='user_login'
---
    function action_log($action = null, $model = null, $record_id = null, $user_id = null){

        //参数检查
        if(empty($action) || empty($model) || empty($record_id)){
            return '参数不能为空';
        }
        if(empty($user_id)){
            $user_id = isLogin();
        }

        //查询行为,判断是否执行
        $action_info =LeAction::find()->where(array('name'=>$action))->asArray()->one();    // M('Action')->getByName($action);