system/models/LeConfigDB.php

    function getList($group=null)
    {
        $map=' `status`=1 ';
        if(!empty($group))
        {
            $map.=' AND `group`='.$group;
        }
        $list=LeConfig::find()->where($map)->orderBy('sort')->asArray()->all();
---
SELECT * FROM `le_config` WHERE  `status`=1  AND `group`=1 ORDER BY `sort`